tiborsimon/embedded-tdd-headers/pic/pic18/pic18f46k40_tdd.h
#define ADCAP1                        1649
#define ADCAP2                        1650
#define ADCAP3                        1651
#define ADCAP4                        1652
#define ADPRE0                        1653
#define ADPRE                         1654
#define ADPRE1                        1655
#define ADPRE2                        1656
#define ADPRE3                        1657
#define ADPRE4                        1658
#define ADPRE5                        1659
#define ADPRE6                        1660
#define ADPRE7                        1661
#define ADPCH                         1662
#define ADPCH0                        1663
#define ADPCH1                        1664
#define ADPCH2                        1665
#define ADPCH3                        1666
#define ADPCH4                        1667
#define ADPCH5                        1668
#define ADCON0                        1669
#define ADCON0_GO                     1670
#define DONE                          1671
#define GO_NOT_DONE                   1672
#define GO_nDONE                      1673
#define ADGO                          1674
#define GODONE                        1675
#define ADFM                          1676
#define ADFM0                         1677
#define ADCON0_ADCS                   1678
#define ADCONT                        1679
#define ADCAL                         1680
#define ADON                          1681
#define ADPREVL                       1682
#define ADPREV0                       1683
#define ADPREV1                       1684
#define ADPREV2                       1685
#define ADPREV3                       1686
#define ADPREV4                       1687
#define ADPREV5                       1688
#define ADPREV6                       1689
#define ADPREV7                       1690
#define ADPREVH                       1691
#define ADPREV8                       1692
#define ADPREV9                       1693
#define ADPREV10                      1694
#define ADPREV11                      1695
#define ADPREV12                      1696
#define ADPREV13                      1697
#define ADPREV14                      1698
#define ADPREV15                      1699
#define ADRESL                        1700
#define ADRES0                        1701
#define ADRES1                        1702
#define ADRES2                        1703
#define ADRES3                        1704
#define ADRES4                        1705
#define ADRES5                        1706
#define ADRES6                        1707
#define ADRES7                        1708
#define ADRESH                        1709
#define ADRES8                        1710
#define ADRES9                        1711
#define ADRES10                       1712
#define ADRES11                       1713
#define ADRES12                       1714
#define ADRES13                       1715
#define ADRES14                       1716
#define ADRES15                       1717
#define ADSTAT                        1718
#define ADSTAT0                       1719
#define ADSTAT1                       1720
#define ADSTAT2                       1721
#define ADMATH                        1722
#define ADLTHR                        1723
#define ADUTHR                        1724
#define ADAOV                         1725
#define ADRPT0                        1726
#define ADRPT                         1727
#define ADRPT1                        1728
#define ADRPT2                        1729
#define ADRPT3                        1730
#define ADRPT4                        1731
#define ADRPT5                        1732
#define ADRPT6                        1733
#define ADRPT7                        1734
#define ADCNT0                        1735
#define ADCNT                         1736
#define ADCNT1                        1737
#define ADCNT2                        1738
#define ADCNT3                        1739
#define ADCNT4                        1740
#define ADCNT5                        1741
#define ADCNT6                        1742
#define ADCNT7                        1743
#define ADSTPT0                       1744
#define ADSTPTL                       1745
#define ADSTPT1                       1746
#define ADSTPT2                       1747
#define ADSTPT3                       1748
#define ADSTPT4                       1749
#define ADSTPT5                       1750
#define ADSTPT6                       1751
#define ADSTPT7                       1752
#define ADSTPT8                       1753
#define ADSTPTH                       1754
#define ADSTPT9                       1755
#define ADSTPT10                      1756
#define ADSTPT11                      1757
#define ADSTPT12                      1758
#define ADSTPT13                      1759
#define ADSTPT14                      1760
#define ADSTPT15                      1761
#define ADLTH0                        1762
#define ADLTHL                        1763
#define ADLTH1                        1764
#define ADLTH2                        1765
#define ADLTH3                        1766
#define ADLTH4                        1767
#define ADLTH5                        1768
#define ADLTH6                        1769
#define ADLTH7                        1770
#define ADLTH8                        1771
#define ADLTHH                        1772
#define ADLTH9                        1773
#define ADLTH10                       1774
#define ADLTH11                       1775
#define ADLTH12                       1776
#define ADLTH13                       1777
#define ADLTH14                       1778
#define ADLTH15                       1779
#define ADUTH0                        1780
#define ADUTHL                        1781
#define ADUTH1                        1782
#define ADUTH2                        1783
#define ADUTH3                        1784
#define ADUTH4                        1785
#define ADUTH5                        1786
#define ADUTH6                        1787
#define ADUTH7                        1788
#define ADUTH8                        1789
#define ADUTHH                        1790
#define ADUTH9                        1791
#define ADUTH10                       1792
#define ADUTH11                       1793
#define ADUTH12                       1794
#define ADUTH13                       1795
#define ADUTH14                       1796
#define ADUTH15                       1797
#define ADERR0                        1798
#define ADERRL                        1799
#define ADERR1                        1800
#define ADERR2                        1801
#define ADERR3                        1802
#define ADERR4                        1803
#define ADERR5                        1804
#define ADERR6                        1805
#define ADERR7                        1806
#define ADERR8                        1807
#define ADERRH                        1808
#define ADERR9                        1809
#define ADERR10                       1810
#define ADERR11                       1811
#define ADERR12                       1812
#define ADERR13                       1813
#define ADERR14                       1814
#define ADERR15                       1815
#define ADACC0                        1816
#define ADACCL                        1817
#define ADACC1                        1818
#define ADACC2                        1819
#define ADACC3                        1820
#define ADACC4                        1821
#define ADACC5                        1822
#define ADACC6                        1823
#define ADACC7                        1824
#define ADACC8                        1825
#define ADACCH                        1826
#define ADACC9                        1827
#define ADACC10                       1828
#define ADACC11                       1829
#define ADACC12                       1830
#define ADACC13                       1831
#define ADACC14                       1832
#define ADACC15                       1833
#define ADFLTR0                       1834
#define ADFLTRL                       1835
#define ADFLTR1                       1836
#define ADFLTR2                       1837
#define ADFLTR3                       1838
#define ADFLTR4                       1839
#define ADFLTR5                       1840
#define ADFLTR6                       1841
#define ADFLTR7                       1842
#define ADFLTR8                       1843
#define ADFLTRH                       1844
#define ADFLTR9                       1845
#define ADFLTR10                      1846
#define ADFLTR11                      1847
#define ADFLTR12                      1848
#define ADFLTR13                      1849
#define ADFLTR14                      1850
#define ADFLTR15                      1851
#define CRCDATL                       1852
#define DATA0                         1853
#define DATA1                         1854
#define DATA2                         1855
#define DATA3                         1856
#define DATA4                         1857
#define DATA5                         1858
#define DATA6                         1859
#define DATA7                         1860
#define CRCDATH                       1861
#define DATA8                         1862
#define DATA9                         1863
#define DATA10                        1864
#define DATA11                        1865
#define DATA12                        1866
#define DATA13                        1867
#define DATA14                        1868
#define DATA15                        1869
#define CRCACCL                       1870
#define ACC0                          1871
#define ACC1                          1872
#define ACC2                          1873
#define ACC3                          1874
#define ACC4                          1875
#define ACC5                          1876
#define ACC6                          1877
#define ACC7                          1878
#define CRCACCH                       1879
#define ACC8                          1880
#define ACC9                          1881
#define ACC10                         1882
#define ACC11                         1883
#define ACC12                         1884
#define ACC13                         1885
#define ACC14                         1886
#define ACC15                         1887
#define CRCSHIFTL                     1888
#define SHFT0                         1889
#define SHFT1                         1890
#define SHFT2                         1891
#define SHFT3                         1892
#define SHFT4                         1893
#define SHFT5                         1894
#define SHFT6                         1895
#define SHFT7                         1896
#define CRCSHIFTH                     1897
#define SHFT8                         1898
#define SHFT9                         1899
#define SHFT10                        1900
#define SHFT11                        1901
#define SHFT12                        1902
#define SHFT13                        1903
#define SHFT14                        1904
#define SHFT15                        1905
#define CRCXORL                       1906
#define X1                            1907
#define X2                            1908
#define X3                            1909
#define X4                            1910
#define X5                            1911
#define X6                            1912
#define X7                            1913
#define CRCXORH                       1914
#define X8                            1915
#define X9                            1916
#define X10                           1917
#define X11                           1918
#define X12                           1919
#define X13                           1920
#define X14                           1921
#define X15                           1922
#define CRCCON0                       1923
#define FULL                          1924
#define SHIFTM                        1925
#define ACCM                          1926
#define CRCCON0_BUSY                  1927
#define CRCGO                         1928
#define CRCCON0_EN                    1929
#define CRCEN                         1930
#define CRCCON1                       1931
#define PLEN0                         1932
#define PLEN                          1933
#define PLEN1                         1934
#define PLEN2                         1935
#define PLEN3                         1936
#define DLEN                          1937
#define DLEN0                         1938
#define DLEN1                         1939
#define DLEN2                         1940
#define DLEN3                         1941
#define NVMADRL                       1942
#define ADR0                          1943
#define ADR                           1944
#define NVMADR0                       1945
#define ADR1                          1946
#define NVMADR1                       1947
#define ADR2                          1948
#define NVMADR2                       1949
#define ADR3                          1950
#define NVMADR3                       1951
#define ADR4                          1952
#define NVMADR4                       1953
#define NVMADR5                       1954
#define ADR5                          1955
#define ADR6                          1956
#define NVMADR6                       1957
#define ADR7                          1958
#define NVMADR7                       1959
#define NVMADRH                       1960
#define ADRH                          1961
#define NVMADR8                       1962
#define ADR8                          1963
#define ADR9                          1964
#define NVMADR9                       1965
#define NVMDAT0                       1966
#define NVMDAT                        1967
#define NVMDAT1                       1968
#define NVMDAT2                       1969
#define NVMDAT3                       1970
#define NVMDAT4                       1971
#define NVMDAT5                       1972
#define NVMDAT6                       1973
#define NVMDAT7                       1974
#define NVMCON1                       1975
#define RD                            1976
#define WR                            1977
#define WREN                          1978
#define WRERR                         1979
#define FREE                          1980
#define NVMREG                        1981
#define NVMREG0                       1982
#define NVMREG1                       1983
#define NVMCON2                       1984
#define LATA                          1985
#define LATA0                         1986
#define LA0                           1987
#define LATA1                         1988
#define LA1                           1989
#define LATA2                         1990
#define LA2                           1991
#define LATA3                         1992
#define LA3                           1993
#define LATA4                         1994
#define LA4                           1995
#define LATA5                         1996
#define LA5                           1997
#define LATA6                         1998
#define LA6                           1999
#define LATA7                         2000
#define LA7                           2001
#define LATB                          2002
#define LB0                           2003
#define LATB0                         2004
#define LB1                           2005
#define LATB1                         2006
#define LB2                           2007
#define LATB2                         2008
#define LB3                           2009
#define LATB3                         2010
#define LB4                           2011
#define LATB4                         2012
#define LB5                           2013
#define LATB5                         2014
#define LB6                           2015
#define LATB6                         2016
#define LB7                           2017
#define LATB7                         2018
#define LATC                          2019
#define LATC0                         2020
#define LC0                           2021
#define LATC1                         2022
#define LC1                           2023
#define LATC2                         2024
#define LC2                           2025
#define LATC3                         2026
#define LC3                           2027
#define LATC4                         2028
#define LC4                           2029
#define LATC5                         2030
#define LC5                           2031
#define LATC6                         2032
#define LC6                           2033
#define LATC7                         2034
#define LC7                           2035
#define LATD                          2036
#define LATD0                         2037
#define LD0                           2038
#define LATD1                         2039
#define LD1                           2040
#define LATD2                         2041
#define LD2                           2042
#define LATD3                         2043
#define LD3                           2044
#define LATD4                         2045
#define LD4                           2046
#define LATD5                         2047
#define LD5                           2048
#define LATD6                         2049
#define LD6                           2050
#define LATD7                         2051
#define LD7                           2052
#define LATE                          2053
#define LATE0                         2054
#define LE0                           2055
#define LATE1                         2056
#define LE1                           2057
#define LATE2                         2058
#define LE2                           2059
#define LE3                           2060
#define LE4                           2061
#define LE5                           2062
#define LE6                           2063
#define LE7                           2064
#define TRISA                         2065
#define TRISA0                        2066
#define TRISA_RA0                     2067
#define TRISA1                        2068
#define TRISA_RA1                     2069
#define TRISA2                        2070
#define TRISA_RA2                     2071
#define TRISA3                        2072
#define TRISA_RA3                     2073
#define TRISA_RA4                     2074
#define TRISA4                        2075
#define TRISA_RA5                     2076
#define TRISA5                        2077
#define TRISA_RA6                     2078
#define TRISA6                        2079
#define TRISA_RA7                     2080
#define TRISA7                        2081
#define TRISB                         2082
#define TRISB_RB0                     2083
#define TRISB0                        2084
#define TRISB_RB1                     2085
#define TRISB1                        2086
#define TRISB_RB2                     2087
#define TRISB2                        2088
#define TRISB_RB3                     2089
#define TRISB3                        2090
#define TRISB_RB4                     2091
#define TRISB4                        2092
#define TRISB_RB5                     2093
#define TRISB5                        2094
#define TRISB_RB6                     2095
#define TRISB6                        2096
#define TRISB_RB7                     2097
#define TRISB7                        2098
#define TRISC                         2099
#define TRISC0                        2100
#define TRISC_RC0                     2101
#define TRISC1                        2102
#define TRISC_RC1                     2103
#define TRISC2                        2104
#define TRISC_RC2                     2105
#define TRISC3                        2106
#define TRISC_RC3                     2107
#define TRISC4                        2108
#define TRISC_RC4                     2109
#define TRISC5                        2110
#define TRISC_RC5                     2111
#define TRISC6                        2112
#define TRISC_RC6                     2113
#define TRISC7                        2114
#define TRISC_RC7                     2115
#define TRISD                         2116
#define TRISD_RD0                     2117
#define TRISD0                        2118
#define TRISD_RD1                     2119
#define TRISD1                        2120
#define TRISD_RD2                     2121
#define TRISD2                        2122
#define TRISD_RD3                     2123
#define TRISD3                        2124
#define TRISD_RD4                     2125
#define TRISD4                        2126
#define TRISD_RD5                     2127
#define TRISD5                        2128
#define TRISD_RD6                     2129
#define TRISD6                        2130
#define TRISD_RD7                     2131
#define TRISD7                        2132
#define TRISE                         2133
#define TRISE_RE0                     2134
#define TRISE0                        2135
#define TRISE_RE1                     2136
#define TRISE1                        2137
#define TRISE_RE2                     2138
#define TRISE2                        2139
#define PORTA                         2140
#define ULPWUIN                       2141
#define PORTA_RA0                     2142
#define PORTA_RA1                     2143
#define PORTA_RA2                     2144
#define PORTA_RA3                     2145
#define PORTA_RA4                     2146
#define LVDIN                         2147
#define PORTA_RA5                     2148
#define PORTA_RA6                     2149
#define PORTA_RA7                     2150
#define RJPU                          2151
#define PORTB                         2152
#define PORTB_RB0                     2153
#define PORTB_RB1                     2154
#define PORTB_RB2                     2155
#define CCP2_PA2                      2156
#define PORTB_RB3                     2157
#define PORTB_RB4                     2158
#define PORTB_RB5                     2159
#define PORTB_RB6                     2160
#define PORTB_RB7                     2161
#define PORTC                         2162
#define PORTC_RC0                     2163
#define PA2                           2164
#define PORTC_RC1                     2165
#define CCP2                          2166
#define PA1                           2167
#define PORTC_RC2                     2168
#define PORTC_RC3                     2169
#define PORTC_RC4                     2170
#define PORTC_RC5                     2171
#define PORTC_RC6                     2172
#define PORTC_RC7                     2173
#define PORTD                         2174
#define PORTD_RD0                     2175
#define PORTD_RD1                     2176
#define PORTD_RD2                     2177
#define PORTD_RD3                     2178
#define PORTD_RD4                     2179
#define PORTD_RD5                     2180
#define PORTD_RD6                     2181
#define PORTD_RD7                     2182
#define SS2                           2183
#define PORTE                         2184
#define PD2                           2185
#define RDE                           2186
#define PORTE_RE0                     2187
#define WRE                           2188
#define PORTE_RE1                     2189
#define PC2                           2190
#define PORTE_CS                      2191
#define CCP10                         2192
#define PB2                           2193
#define PORTE_RE2                     2194
#define CCP9E                         2195
#define RE3                           2196
#define PC3E                          2197
#define RE4                           2198
#define PB3E                          2199
#define CCP8E                         2200
#define CCP7E                         2201
#define RE5                           2202
#define PC1E                          2203
#define CCP6E                         2204
#define RE6                           2205
#define PB1E                          2206
