tiborsimon/embedded-tdd-headers/pic/pic18/pic18f46k40_tdd.h
#define T5GE                          2765
#define T5GATE                        2766
#define T5GATE_GSS0                   2767
#define T5GSS0                        2768
#define T5GATE_GSS                    2769
#define T5GATE_GSS1                   2770
#define T5GSS1                        2771
#define T5GATE_GSS2                   2772
#define T5GSS2                        2773
#define T5GATE_GSS3                   2774
#define T5GSS3                        2775
#define T5CLK                         2776
#define T5CS0                         2777
#define T5CLK_CS                      2778
#define T5CLK_CS0                     2779
#define T5CS1                         2780
#define T5CLK_CS1                     2781
#define T5CS2                         2782
#define T5CLK_CS2                     2783
#define T5CS3                         2784
#define T5CLK_CS3                     2785
#define TMR3L0                        2786
#define TMR3L                         2787
#define TMR3L1                        2788
#define TMR3L2                        2789
#define TMR3L3                        2790
#define TMR3L4                        2791
#define TMR3L5                        2792
#define TMR3L6                        2793
#define TMR3L7                        2794
#define TMR3H                         2795
#define TMR3H0                        2796
#define TMR3H1                        2797
#define TMR3H2                        2798
#define TMR3H3                        2799
#define TMR3H4                        2800
#define TMR3H5                        2801
#define TMR3H6                        2802
#define TMR3H7                        2803
#define T3CON                         2804
#define T3CON_ON                      2805
#define TMR3ON                        2806
#define T3CON_RD16                    2807
#define RD163                         2808
#define T3RD16                        2809
#define T3CON_NOT_SYNC                2810
#define T3CON_nSYNC                   2811
#define NOT_T3SYNC                    2812
#define nT3SYNC                       2813
#define T3CKPS0                       2814
#define T3CON_CKPS0                   2815
#define T3CON_CKPS                    2816
#define T3CKPS1                       2817
#define T3CON_CKPS1                   2818
#define T3GCON                        2819
#define T3GVAL                        2820
#define T3GCON_GVAL                   2821
#define T3GGO                         2822
#define T3GGO_NOT_DONE                2823
#define T3GCON_GGO_nDONE              2824
#define T3GGO_nDONE                   2825
#define T3GCON_GGO_NOT_DONE           2826
#define T3GCON_GSPM                   2827
#define T3GSPM                        2828
#define T3GCON_GTM                    2829
#define T3GTM                         2830
#define T3GCON_GPOL                   2831
#define T3GPOL                        2832
#define T3GCON_GE                     2833
#define T3GE                          2834
#define T3GATE                        2835
#define T3GSS0                        2836
#define T3GATE_GSS0                   2837
#define T3GATE_GSS                    2838
#define T3GSS1                        2839
#define T3GATE_GSS1                   2840
#define T3GSS2                        2841
#define T3GATE_GSS2                   2842
#define T3GSS3                        2843
#define T3GATE_GSS3                   2844
#define T3CLK                         2845
#define T3CLK_CS                      2846
#define T3CLK_CS0                     2847
#define T3CS0                         2848
#define T3CLK_CS1                     2849
#define T3CS1                         2850
#define T3CLK_CS2                     2851
#define T3CS2                         2852
#define T3CS3                         2853
#define T3CLK_CS3                     2854
#define TMR1L                         2855
#define TMR1L0                        2856
#define TMR1L1                        2857
#define TMR1L2                        2858
#define TMR1L3                        2859
#define TMR1L4                        2860
#define TMR1L5                        2861
#define TMR1L6                        2862
#define TMR1L7                        2863
#define TMR1H0                        2864
#define TMR1H                         2865
#define TMR1H1                        2866
#define TMR1H2                        2867
#define TMR1H3                        2868
#define TMR1H4                        2869
#define TMR1H5                        2870
#define TMR1H6                        2871
#define TMR1H7                        2872
#define T1CON                         2873
#define TMR1ON                        2874
#define T1CON_ON                      2875
#define T1CON_RD16                    2876
#define T1RD16                        2877
#define NOT_T1SYNC                    2878
#define T1CON_nSYNC                   2879
#define nT1SYNC                       2880
#define T1CON_NOT_SYNC                2881
#define T1CON_CKPS0                   2882
#define T1CKPS0                       2883
#define T1CON_CKPS                    2884
#define T1CKPS1                       2885
#define T1CON_CKPS1                   2886
#define T1GCON                        2887
#define T1GCON_GVAL                   2888
#define T1GVAL                        2889
#define T1GGO_NOT_DONE                2890
#define T1GGO_nDONE                   2891
#define T1GCON_GGO_nDONE              2892
#define T1GCON_GGO_NOT_DONE           2893
#define T1GGO                         2894
#define T1GCON_GSPM                   2895
#define T1GSPM                        2896
#define T1GTM                         2897
#define T1GCON_GTM                    2898
#define T1GPOL                        2899
#define T1GCON_GPOL                   2900
#define T1GCON_GE                     2901
#define T1GE                          2902
#define T1GATE                        2903
#define T1GATE_GSS0                   2904
#define T1GSS0                        2905
#define T1GATE_GSS                    2906
#define T1GATE_GSS1                   2907
#define T1GSS1                        2908
#define T1GSS2                        2909
#define T1GATE_GSS2                   2910
#define T1GSS3                        2911
#define T1GATE_GSS3                   2912
#define T1CLK                         2913
#define T1CS0                         2914
#define T1CLK_CS                      2915
#define T1CLK_CS0                     2916
#define T1CLK_CS1                     2917
#define T1CS1                         2918
#define T1CS2                         2919
#define T1CLK_CS2                     2920
#define T1CS3                         2921
#define T1CLK_CS3                     2922
#define TMR0L0                        2923
#define TMR0L                         2924
#define TMR0L1                        2925
#define TMR0L2                        2926
#define TMR0L3                        2927
#define TMR0L4                        2928
#define TMR0L5                        2929
#define TMR0L6                        2930
#define TMR0L7                        2931
#define TMR0H0                        2932
#define T0PR                          2933
#define TMR0H                         2934
#define T0PR0                         2935
#define TMR0H1                        2936
#define T0PR1                         2937
#define TMR0H2                        2938
#define T0PR2                         2939
#define TMR0H3                        2940
#define T0PR3                         2941
#define TMR0H4                        2942
#define T0PR4                         2943
#define TMR0H5                        2944
#define T0PR5                         2945
#define TMR0H6                        2946
#define T0PR6                         2947
#define TMR0H7                        2948
#define T0PR7                         2949
#define T0CON0                        2950
#define T0OUTPS                       2951
#define T0OUTPS0                      2952
#define T0OUTPS1                      2953
#define T0OUTPS2                      2954
#define T0OUTPS3                      2955
#define T016BIT                       2956
#define T0OUT                         2957
#define T0EN                          2958
#define T0CON1                        2959
#define T0PS                          2960
#define T0CKPS                        2961
#define T0CKPS0                       2962
#define T0PS0                         2963
#define T0CKPS1                       2964
#define T0PS1                         2965
#define T0CKPS2                       2966
#define T0PS2                         2967
#define T0CKPS3                       2968
#define T0PS3                         2969
#define T0ASYNC                       2970
#define T0CS                          2971
#define T0CS0                         2972
#define T0CS1                         2973
#define T0CS2                         2974
#define PCON0                         2975
#define BOR                           2976
#define NOT_BOR                       2977
#define nBOR                          2978
#define POR                           2979
#define nPOR                          2980
#define NOT_POR                       2981
#define nRI                           2982
#define NOT_RI                        2983
#define RI                            2984
#define NOT_RMCLR                     2985
#define nRMCLR                        2986
#define RMCLR                         2987
#define NOT_RWDT                      2988
#define nRWDT                         2989
#define RWDT                          2990
#define nWDTWV                        2991
#define WDTWV                         2992
#define NOT_WDTWV                     2993
#define STKUNF                        2994
#define STKOVF                        2995
#define STATUS                        2996
#define C                             2997
#define CARRY                         2998
#define STATUS_DC                     2999
#define ZERO                          3000
#define Z                             3001
#define OV                            3002
#define OVERFLOW                      3003
#define N                             3004
#define NEGATIVE                      3005
#define PD                            3006
#define nPD                           3007
#define NOT_PD                        3008
#define TO                            3009
#define NOT_TO                        3010
#define nTO                           3011
#define FSR2L                         3012
#define PLUSW2                        3013
#define PREINC2                       3014
#define POSTDEC2                      3015
#define POSTINC2                      3016
#define INDF2                         3017
#define FSR1L                         3018
#define PLUSW1                        3019
#define PREINC1                       3020
#define POSTDEC1                      3021
#define POSTINC1                      3022
#define INDF1                         3023
#define WREG                          3024
#define FSR0L                         3025
#define PLUSW0                        3026
#define PREINC0                       3027
#define POSTDEC0                      3028
#define POSTINC0                      3029
#define INDF0                         3030
#define INTCON                        3031
#define INT0EDG                       3032
#define INT1EDG                       3033
#define INT2EDG                       3034
#define IPEN                          3035
#define PEIE                          3036
#define PEIE_GIEL                     3037
#define GIEL                          3038
#define GIE                           3039
#define GIE_GIEH                      3040
#define GIEH                          3041
#define PRODL                         3042
#define PRODH                         3043
#define TABLAT                        3044
#define TBLPTRL                       3045
#define TBLPTRH                       3046
#define TBLPTRU                       3047
#define ACSS                          3048
#define PCL                           3049
#define PCLATH                        3050
#define PCLATH_PCH                    3051
#define PCLATU                        3052
#define PCU                           3053
#define STKPTR0                       3054
#define STKPTR                        3055
#define SP0                           3056
#define STKPTR1                       3057
#define SP1                           3058
#define STKPTR2                       3059
#define SP2                           3060
#define SP3                           3061
#define STKPTR3                       3062
#define STKPTR4                       3063
#define SP4                           3064
#define STKPTR5                       3065
#define SP5                           3066
#define TOSL                          3067
#define TOSH                          3068

#endif // _PIC18F46K40_H_
